---
kind: property
id: P:Autodesk.Revit.DB.Mechanical.Space.SpaceTypeId
source: html/51ca46cc-b91f-68cc-3960-4a43bd41a154.htm
---
# Autodesk.Revit.DB.Mechanical.Space.SpaceTypeId Property

Get or set the Space type element of the Space.

## Syntax (C#)
```csharp
public ElementId SpaceTypeId { get; set; }
```

## Remarks
This property is used to get or set the Space type of the Space.